src/rust/advanced.org
#+TITLE: 高阶内容
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+HTML_LINK_UP: pattern.html   
#+HTML_LINK_HOME: rust.html
#+OPTIONS: num:nil timestamp:nil ^:nil

#+BEGIN_EXAMPLE
  现在已经学习了 Rust 编程语言中最常用的部分。接下来的功能在一些非常特定的场景下很有用处

  虽然很少会碰到它们，这会确保了解 Rust 提供的所有功能

#+END_EXAMPLE
本章将涉及如下内容：
+ 不安全 Rust：用于当需要舍弃 Rust 的某些保证并负责手动维持这些保证
+ 高级 trait：与 trait 相关的关联类型，默认类型参数，完全限定语法，超父trait和 newtype 模式
+ 高级类型：关于 newtype 模式的更多内容，类型别名，never 类型和动态大小类型
+ 高级函数和闭包：函数指针和返回闭包
+ 宏：定义在编译时定义更多代码的方式
* 不安全 Rust 
  目前为止讨论过的代码都有 Rust 在编译时会强制执行的内存安全保证。然而，Rust 还隐藏有第二种语言，它不会强制执行这类内存安全保证：这被称为 _不安全 Rust_ 。它与常规 Rust 代码无异，但是会提供额外的超级力量
  +  不安全 Rust 之所以存在，是因为静态分析本质上是保守的
  #+BEGIN_EXAMPLE
    当编译器尝试确定一段代码是否支持某个保证时，拒绝一些有效的程序比接受无效程序要好一些

    这必然意味着有时代码可能是合法的，但是 Rust 不这么认为！

    在这种情况下，可以使用不安全代码告诉编译器，“相信我，我知道我在干什么。”

    这么做的缺点就是你只能靠自己了：如果不安全代码出错了，比如解引用空指针，可能会导致不安全的内存使用
  #+END_EXAMPLE
  + 另一个 Rust 存在不安全一面的原因是：底层计算机硬件固有的不安全性
  #+BEGIN_EXAMPLE
    如果 Rust 不允许进行不安全操作，那么有些任务则根本完成不了

    Rust 需要能够进行像直接与操作系统交互，甚至于编写自己的操作系统这样的底层系统编程！
  #+END_EXAMPLE

  先看看不安全 Rust 能做什么，和怎么做
** 不安全的超级力量
   可以通过 _unsafe_ 关键字来切换到不安全 Rust，接着可以开启一个新的存放不安全代码的块。这里有几类可以在不安全 Rust 中进行而不能用于安全 Rust 的操作，它们称之为 “不安全的超级力量。” 这些超级力量是：
   1. 解引用裸指针
   2. 调用不安全的函数或方法
   3. 访问或修改可变静态变量
   4. 实现不安全 trait

   有一点很重要，unsafe 并不会关闭 _借用检查器_ 或禁用任何 _其他 Rust 安全检查_ ：如果在不安全代码中使用引用，它仍会被检查

   #+BEGIN_EXAMPLE
     unsafe 关键字只是提供了那几个不会被编译器检查内存安全的功能

     仍然能在不安全块中获得某种程度的安全
   #+END_EXAMPLE

   再者，unsafe 不意味着块中的代码就一定是危险的或者必然导致内存安全问题：其意图在于作为程序员将会确保 unsafe 块中的代码以有效的方式访问内存
   #+BEGIN_EXAMPLE
     人是会犯错误的，错误总会发生

     不过通过要求这类操作必须位于标记为 unsafe 的块中，就能够知道任何与内存安全相关的错误必定位于 unsafe 块内

     保持 unsafe 块尽可能小，如此当之后调查内存 bug 时就会感谢你自己了
   #+END_EXAMPLE
   为了尽可能隔离不安全代码，将 _不安全代码_ *封装* 进一个 _安全的抽象_ 并 *提供* _安全 API_ 是一个好主意

   #+BEGIN_EXAMPLE
     标准库的一部分被实现为在被评审过的不安全代码之上的安全抽象

     这个技术防止了 unsafe 泄露到所有你或者用户希望使用由 unsafe 代码实现的功能的地方，因为使用其安全抽象是安全的
   #+END_EXAMPLE

   接下来按顺序依次介绍上述几个超级力量，同时会看到一些提供不安全代码的安全接口的抽象
** 解引用裸指针
   #+BEGIN_EXAMPLE
   回到前面的 “悬垂引用” 部分，那里提到了编译器会确保引用总是有效的
   #+END_EXAMPLE
   不安全 Rust 有两个被称为 _裸指针_ 的类似于引用的新类型。和引用一样，裸指针是 _可变_ 或 _不可变_ 的，分别写作 _*const T_ 和 _*mut T_ 
   + 这里的 _星号_ 不是解引用运算符；它是 *类型名称* 的一部分
   + 在裸指针的上下文中，不可变意味着 _指针解引用_ 之后 *不能直接* _赋值_ 

   与引用和智能指针的区别在于，记住裸指针：
   + 允许忽略借用规则，可以同时拥有不可变和可变的指针，或多个指向相同位置的可变指针
   + 不保证指向有效的内存
   + 允许为空
   + 不能实现任何自动清理功能

   #+BEGIN_EXAMPLE
   通过去掉 Rust 强加的保证，可以放弃安全保证以换取性能或使用另一个语言或硬件接口的能力，此时 Rust 的保证并不适用
   #+END_EXAMPLE
   下面展示了如何从引用同时创建不可变和可变裸指针：

   #+BEGIN_SRC rust 
  let mut num = 5;

  let r1 = &num as *const i32;
  let r2 = &mut num as *mut i32;
   #+END_SRC

   注意：这里没有引入 unsafe 关键字。可以在 _安全代码_ 中 *创建* 裸指针，只是 *不能* 在 _不安全块之外_ *解引用* 裸指针

   #+BEGIN_EXAMPLE
     这里使用 as 将不可变和可变引用强转为对应的裸指针类型

     因为直接从保证安全的引用来创建他们，可以知道这些特定的裸指针是有效，但是不能对任何裸指针做出如此假设

   #+END_EXAMPLE
   接下来创建一个不能确定其有效性的裸指针，下面展示了如何创建一个指向任意内存地址的裸指针

   #+BEGIN_SRC rust 
  let address = 0x012345usize;
  let r = address as *const i32;
   #+END_SRC

   #+BEGIN_EXAMPLE
     尝试使用任意内存是未定义行为：此地址可能有数据也可能没有，编译器可能会优化掉这个内存访问，或者程序可能会出现段错误

     通常没有好的理由编写这样的代码，不过却是可行的
   #+END_EXAMPLE

   对裸指针使用解引用运算符 *，这需要一个 unsafe 块：

   #+BEGIN_SRC rust 
  let mut num = 5;

  let r1 = &num as *const i32;
  let r2 = &mut num as *mut i32;

  unsafe {
      println!("r1 is: {}", *r1);
      println!("r2 is: {}", *r2);
  }
   #+END_SRC

   #+BEGIN_EXAMPLE
     创建一个指针不会造成任何危险；只有当访问其指向的值时才有可能遇到无效的值
   #+END_EXAMPLE
   示例创建了同时指向相同内存位置 num 的裸指针 *const i32 和 *mut i32
   + 如果尝试创建 num 的不可变和可变引用，这将无法编译因为 Rust 的所有权规则不允许拥有可变引用的同时拥有不可变引用
   + 通过裸指针，就能够同时创建同一地址的可变指针和不可变指针
   + 若通过 _可变指针_ *修改* 数据，则可能造成 _数据竞争_ 

   #+BEGIN_EXAMPLE
     既然存在这么多的危险，为何还要使用裸指针呢？

     一个主要的应用场景便是调用 C 代码接口

     另一个场景是构建借用检查器无法理解的安全抽象
   #+END_EXAMPLE
** 调用不安全函数或方法
   不安全函数和方法与常规函数方法十分类似，除了其开头有一个额外的 _unsafe_ 

   #+BEGIN_EXAMPLE
     在此上下文中，关键字unsafe表示该函数具有调用时需要满足的要求，而 Rust 不会保证满足这些要求

     通过在 unsafe 块中调用不安全函数，表明已经阅读过此函数的文档并对其是否满足函数自身的契约负责
   #+END_EXAMPLE

   如下是一个没有做任何操作的不安全函数 dangerous 的例子：

   #+BEGIN_SRC rust 
  unsafe fn dangerous() {}

  unsafe {
      dangerous();
  }
   #+END_SRC

   必须在一个单独的 unsafe 块中调用 dangerous 函数。如果尝试不使用 unsafe 块调用 dangerous，则会得到一个错误：
   #+BEGIN_SRC sh 
  error[E0133]: call to unsafe function requires unsafe function or block
   -->
    |
  4 |     dangerous();
    |     ^^^^^^^^^^^ call to unsafe function
   #+END_SRC

   #+BEGIN_EXAMPLE
     通过将 dangerous 调用插入 unsafe 块中，就向 Rust 保证了已经阅读过函数的文档，理解如何正确使用，并验证过其满足函数的契约
   #+END_EXAMPLE
   不安全函数体也是有效的 unsafe 块，所以在不安全函数中进行另一个不安全操作时无需新增额外的 unsafe 块
