html/rust/advanced.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>高阶内容</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />

<link rel="stylesheet" type="text/css" href="css/main.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="pattern.html"> UP </a>
 |
 <a accesskey="H" href="rust.html"> HOME </a>
</div><div id="content">
<h1 class="title">高阶内容</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org73d5c15">不安全 Rust</a>
<ul>
<li><a href="#orgd68e828">不安全的超级力量</a></li>
<li><a href="#org6ae519e">解引用裸指针</a></li>
<li><a href="#org39816da">调用不安全函数或方法</a>
<ul>
<li><a href="#orga94d504">创建不安全代码的安全抽象</a></li>
<li><a href="#org2c1a5b4">使用 extern 函数调用外部代码</a>
<ul>
<li><a href="#orge6cf4c6">从其它语言调用 Rust 函数</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge7a5d9c">访问或修改可变静态变量</a></li>
<li><a href="#org4ef2018">实现不安全 trait</a></li>
<li><a href="#org2f45392">何时使用不安全代码</a></li>
</ul>
</li>
</ul>
</div>
</div>
<pre class="example">
  现在已经学习了 Rust 编程语言中最常用的部分。接下来的功能在一些非常特定的场景下很有用处

  虽然很少会碰到它们，这会确保了解 Rust 提供的所有功能

</pre>
<p>
本章将涉及如下内容：
</p>
<ul class="org-ul">
<li>不安全 Rust：用于当需要舍弃 Rust 的某些保证并负责手动维持这些保证</li>
<li>高级 trait：与 trait 相关的关联类型，默认类型参数，完全限定语法，超父trait和 newtype 模式</li>
<li>高级类型：关于 newtype 模式的更多内容，类型别名，never 类型和动态大小类型</li>
<li>高级函数和闭包：函数指针和返回闭包</li>
<li>宏：定义在编译时定义更多代码的方式</li>
</ul>
<div id="outline-container-org73d5c15" class="outline-2">
<h2 id="org73d5c15">不安全 Rust</h2>
<div class="outline-text-2" id="text-org73d5c15">
<p>
目前为止讨论过的代码都有 Rust 在编译时会强制执行的内存安全保证。然而，Rust 还隐藏有第二种语言，它不会强制执行这类内存安全保证：这被称为 <span class="underline">不安全 Rust</span> 。它与常规 Rust 代码无异，但是会提供额外的超级力量
</p>
<ul class="org-ul">
<li>不安全 Rust 之所以存在，是因为静态分析本质上是保守的</li>
</ul>
<pre class="example">
    当编译器尝试确定一段代码是否支持某个保证时，拒绝一些有效的程序比接受无效程序要好一些

    这必然意味着有时代码可能是合法的，但是 Rust 不这么认为！

    在这种情况下，可以使用不安全代码告诉编译器，“相信我，我知道我在干什么。”

    这么做的缺点就是你只能靠自己了：如果不安全代码出错了，比如解引用空指针，可能会导致不安全的内存使用
</pre>
<ul class="org-ul">
<li>另一个 Rust 存在不安全一面的原因是：底层计算机硬件固有的不安全性</li>
</ul>
<pre class="example">
如果 Rust 不允许进行不安全操作，那么有些任务则根本完成不了

Rust 需要能够进行像直接与操作系统交互，甚至于编写自己的操作系统这样的底层系统编程！
</pre>

<p>
先看看不安全 Rust 能做什么，和怎么做
</p>
</div>
<div id="outline-container-orgd68e828" class="outline-3">
<h3 id="orgd68e828">不安全的超级力量</h3>
<div class="outline-text-3" id="text-orgd68e828">
<p>
可以通过 <span class="underline">unsafe</span> 关键字来切换到不安全 Rust，接着可以开启一个新的存放不安全代码的块。这里有几类可以在不安全 Rust 中进行而不能用于安全 Rust 的操作，它们称之为 “不安全的超级力量。” 这些超级力量是：
</p>
<ol class="org-ol">
<li>解引用裸指针</li>
<li>调用不安全的函数或方法</li>
<li>访问或修改可变静态变量</li>
<li>实现不安全 trait</li>
</ol>

<p>
有一点很重要，unsafe 并不会关闭 <span class="underline">借用检查器</span> 或禁用任何 <span class="underline">其他 Rust 安全检查</span> ：如果在不安全代码中使用引用，它仍会被检查
</p>

<pre class="example">
unsafe 关键字只是提供了那几个不会被编译器检查内存安全的功能

仍然能在不安全块中获得某种程度的安全
</pre>

<p>
再者，unsafe 不意味着块中的代码就一定是危险的或者必然导致内存安全问题：其意图在于作为程序员将会确保 unsafe 块中的代码以有效的方式访问内存
</p>
<pre class="example">
     人是会犯错误的，错误总会发生

     不过通过要求这类操作必须位于标记为 unsafe 的块中，就能够知道任何与内存安全相关的错误必定位于 unsafe 块内

     保持 unsafe 块尽可能小，如此当之后调查内存 bug 时就会感谢你自己了
</pre>
<p>
为了尽可能隔离不安全代码，将 <span class="underline">不安全代码</span> <b>封装</b> 进一个 <span class="underline">安全的抽象</span> 并 <b>提供</b> <span class="underline">安全 API</span> 是一个好主意
</p>

<pre class="example">
     标准库的一部分被实现为在被评审过的不安全代码之上的安全抽象

     这个技术防止了 unsafe 泄露到所有你或者用户希望使用由 unsafe 代码实现的功能的地方，因为使用其安全抽象是安全的
</pre>

<p>
接下来按顺序依次介绍上述几个超级力量，同时会看到一些提供不安全代码的安全接口的抽象
</p>
</div>
</div>
<div id="outline-container-org6ae519e" class="outline-3">
<h3 id="org6ae519e">解引用裸指针</h3>
<div class="outline-text-3" id="text-org6ae519e">
<pre class="example">
   回到前面的 “悬垂引用” 部分，那里提到了编译器会确保引用总是有效的
</pre>
<p>
不安全 Rust 有两个被称为 <span class="underline">裸指针</span> 的类似于引用的新类型。和引用一样，裸指针是 <span class="underline">可变</span> 或 <span class="underline">不可变</span> 的，分别写作 <span class="underline">*const T</span> 和 <span class="underline">*mut T</span> 
</p>
<ul class="org-ul">
<li>这里的 <span class="underline">星号</span> 不是解引用运算符；它是 <b>类型名称</b> 的一部分</li>
<li>在裸指针的上下文中，不可变意味着 <span class="underline">指针解引用</span> 之后 <b>不能直接</b> <span class="underline">赋值</span></li>
</ul>

<p>
与引用和智能指针的区别在于，记住裸指针：
</p>
<ul class="org-ul">
<li>允许忽略借用规则，可以同时拥有不可变和可变的指针，或多个指向相同位置的可变指针</li>
<li>不保证指向有效的内存</li>
<li>允许为空</li>
<li>不能实现任何自动清理功能</li>
</ul>

<pre class="example">
   通过去掉 Rust 强加的保证，可以放弃安全保证以换取性能或使用另一个语言或硬件接口的能力，此时 Rust 的保证并不适用
</pre>
<p>
下面展示了如何从引用同时创建不可变和可变裸指针：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #00ffff;">mut</span> <span style="color: #eedd82;">num</span> = 5;

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">r1</span> = &amp;num <span style="color: #00ffff;">as</span> *<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">i32</span>;
<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">r2</span> = &amp;<span style="color: #00ffff;">mut</span> num <span style="color: #00ffff;">as</span> *<span style="color: #00ffff;">mut</span> <span style="color: #98fb98;">i32</span>;
</pre>
</div>

<p>
注意：这里没有引入 unsafe 关键字。可以在 <span class="underline">安全代码</span> 中 <b>创建</b> 裸指针，只是 <b>不能</b> 在 <span class="underline">不安全块之外</span> <b>解引用</b> 裸指针
</p>

<pre class="example">
     这里使用 as 将不可变和可变引用强转为对应的裸指针类型

     因为直接从保证安全的引用来创建他们，可以知道这些特定的裸指针是有效，但是不能对任何裸指针做出如此假设

</pre>
<p>
接下来创建一个不能确定其有效性的裸指针，下面展示了如何创建一个指向任意内存地址的裸指针
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #eedd82;">address</span> = 0x012345usize;
<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">r</span> = address <span style="color: #00ffff;">as</span> *<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">i32</span>;
</pre>
</div>

<pre class="example">
     尝试使用任意内存是未定义行为：此地址可能有数据也可能没有，编译器可能会优化掉这个内存访问，或者程序可能会出现段错误

     通常没有好的理由编写这样的代码，不过却是可行的
</pre>

<p>
对裸指针使用解引用运算符 *，这需要一个 unsafe 块：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #00ffff;">mut</span> <span style="color: #eedd82;">num</span> = 5;

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">r1</span> = &amp;num <span style="color: #00ffff;">as</span> *<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">i32</span>;
<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">r2</span> = &amp;<span style="color: #00ffff;">mut</span> num <span style="color: #00ffff;">as</span> *<span style="color: #00ffff;">mut</span> <span style="color: #98fb98;">i32</span>;

<span style="color: #ffc0cb; font-weight: bold;">unsafe</span> {
    <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"r1 is: </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;">"</span>, *r1);
    <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"r2 is: </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;">"</span>, *r2);
}
</pre>
</div>

<pre class="example">
     创建一个指针不会造成任何危险；只有当访问其指向的值时才有可能遇到无效的值
</pre>
<p>
示例创建了同时指向相同内存位置 num 的裸指针 *const i32 和 *mut i32
</p>
<ul class="org-ul">
<li>如果尝试创建 num 的不可变和可变引用，这将无法编译因为 Rust 的所有权规则不允许拥有可变引用的同时拥有不可变引用</li>
<li>通过裸指针，就能够同时创建同一地址的可变指针和不可变指针</li>
<li>若通过 <span class="underline">可变指针</span> <b>修改</b> 数据，则可能造成 <span class="underline">数据竞争</span></li>
</ul>

<pre class="example">
     既然存在这么多的危险，为何还要使用裸指针呢？

     一个主要的应用场景便是调用 C 代码接口

     另一个场景是构建借用检查器无法理解的安全抽象
</pre>
</div>
</div>
<div id="outline-container-org39816da" class="outline-3">
<h3 id="org39816da">调用不安全函数或方法</h3>
<div class="outline-text-3" id="text-org39816da">
<p>
不安全函数和方法与常规函数方法十分类似，除了其开头有一个额外的 <span class="underline">unsafe</span> 
</p>

<pre class="example">
     在此上下文中，关键字unsafe表示该函数具有调用时需要满足的要求，而 Rust 不会保证满足这些要求

     通过在 unsafe 块中调用不安全函数，表明已经阅读过此函数的文档并对其是否满足函数自身的契约负责
</pre>

<p>
如下是一个没有做任何操作的不安全函数 dangerous 的例子：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffc0cb; font-weight: bold;">unsafe</span> <span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">dangerous</span>() {}

<span style="color: #ffc0cb; font-weight: bold;">unsafe</span> {
    dangerous();
}
</pre>
</div>

<p>
必须在一个单独的 unsafe 块中调用 dangerous 函数。如果尝试不使用 unsafe 块调用 dangerous，则会得到一个错误：
</p>
<div class="org-src-container">
<pre class="src src-sh">error[E0133]: call to unsafe <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">requires</span> unsafe <span style="color: #00ffff;">function</span> <span style="color: #87cefa;">or</span> block
 --&gt;
  |
4 |     dangerous();
  |     ^^^^^^^^^^^ call to unsafe <span style="color: #00ffff;">function</span>
</pre>
</div>

<pre class="example">
     通过将 dangerous 调用插入 unsafe 块中，就向 Rust 保证了已经阅读过函数的文档，理解如何正确使用，并验证过其满足函数的契约
</pre>
<p>
不安全函数体也是有效的 unsafe 块，所以在不安全函数中进行另一个不安全操作时无需新增额外的 unsafe 块
</p>
</div>
