html/rust/advanced.html
<div id="outline-container-orga94d504" class="outline-4">
<h4 id="orga94d504">创建不安全代码的安全抽象</h4>
<div class="outline-text-4" id="text-orga94d504">
<p>
仅仅因为函数包含不安全代码并不意味着整个函数都需要标记为不安全的。事实上，将不安全代码封装进安全函数是一个常见的抽象。作为一个例子，标准库中的函数，split_at_mut，它需要一些不安全代码，这个安全函数定义于可变 slice 之上：它获取一个 slice 并从给定的索引参数开始将其分为两个 slice。split_at_mut 的用法：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">let</span> <span style="color: #00ffff;">mut</span> <span style="color: #eedd82;">v</span> = <span style="color: #7fffd4;">vec!</span>[1, 2, 3, 4, 5, 6];

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">r</span> = &amp;<span style="color: #00ffff;">mut</span> v[..];

<span style="color: #00ffff;">let</span> (a, b) = r.split_at_mut(3);

<span style="color: #7fffd4;">assert_eq!</span>(a, &amp;<span style="color: #00ffff;">mut</span> [1, 2, 3]);
<span style="color: #7fffd4;">assert_eq!</span>(b, &amp;<span style="color: #00ffff;">mut</span> [4, 5, 6]);
</pre>
</div>

<p>
这个函数无法只通过安全 Rust 实现。一个尝试可能看起来像示例，然而它不能编译。出于简单考虑，将 split_at_mut 实现为函数而不是方法，并只处理 i32 值而非泛型 T 的 slice：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">split_at_mut</span>(<span style="color: #eedd82;">slice</span>: &amp;<span style="color: #00ffff;">mut</span> [<span style="color: #98fb98;">i32</span>], <span style="color: #eedd82;">mid</span>: <span style="color: #98fb98;">usize</span>) -&gt; (&amp;<span style="color: #00ffff;">mut</span> [<span style="color: #98fb98;">i32</span>], &amp;<span style="color: #00ffff;">mut</span> [<span style="color: #98fb98;">i32</span>]) {
    <span style="color: #00ffff;">let</span> <span style="color: #eedd82;">len</span> = slice.len();

    <span style="color: #7fffd4;">assert!</span>(mid &lt;= len);

    (&amp;<span style="color: #00ffff;">mut</span> slice[..mid],
     &amp;<span style="color: #00ffff;">mut</span> slice[mid..])
}
</pre>
</div>

<ol class="org-ol">
<li>此函数首先获取 slice 的长度</li>
<li>通过检查参数是否小于或等于这个长度来断言参数所给定的索引位于 slice 当中：该断言意味着如果传入的索引比要分割的 slice 的索引更大，此函数在尝试使用这个索引前 panic</li>
<li>在一个元组中返回两个可变的 slice：一个从原始 slice 的开头直到 mid 索引，另一个从 mid 直到原 slice 的结尾</li>
</ol>

<p>
如果尝试编译的，会得到一个错误：
</p>

<div class="org-src-container">
<pre class="src src-sh">error[E0499]: cannot borrow <span style="color: #fa8072;">`*slice`</span> as mutable more than once at a time
 --&gt;
  |
6 |     (&amp;mut slice[..mid],
  |           ----- first mutable borrow occurs here
7 |      &amp;mut slice[mid..])
  |           ^^^^^ second mutable borrow occurs here
8 | }
  | - first borrow ends here
</pre>
</div>

<p>
Rust 的借用检查器不能理解要借用这个 slice 的两个不同部分：它只知道我们借用了同一个 slice 两次
</p>

<pre class="example">
      本质上借用 slice 的不同部分是可以的，因为结果两个 slice 不会重叠，不过 Rust 还没有智能到能够理解这些

      当我们知道某些事是可以的而 Rust 不知道的时候，就是触及不安全代码的时候了
</pre>
<p>
下面展示了如何使用 unsafe 块，裸指针和一些不安全函数调用来实现 split_at_mut：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">use</span> <span style="color: #7fffd4;">std</span>::slice;

<span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">split_at_mut</span>(<span style="color: #eedd82;">slice</span>: &amp;<span style="color: #00ffff;">mut</span> [<span style="color: #98fb98;">i32</span>], <span style="color: #eedd82;">mid</span>: <span style="color: #98fb98;">usize</span>) -&gt; (&amp;<span style="color: #00ffff;">mut</span> [<span style="color: #98fb98;">i32</span>], &amp;<span style="color: #00ffff;">mut</span> [<span style="color: #98fb98;">i32</span>]) {
    <span style="color: #00ffff;">let</span> <span style="color: #eedd82;">len</span> = slice.len();
    <span style="color: #00ffff;">let</span> <span style="color: #eedd82;">ptr</span> = slice.as_mut_ptr();

    <span style="color: #7fffd4;">assert!</span>(mid &lt;= len);

    <span style="color: #ffc0cb; font-weight: bold;">unsafe</span> {
        (<span style="color: #7fffd4;">slice</span>::from_raw_parts_mut(ptr, mid),
         <span style="color: #7fffd4;">slice</span>::from_raw_parts_mut(ptr.offset(mid <span style="color: #00ffff;">as</span> <span style="color: #98fb98;">isize</span>), len - mid))
    }
}
</pre>
</div>

<p>
slice 是一个指向一些数据的指针，并带有该 slice 的长度。可以使用 len 方法获取 slice 的长度，使用 <span class="underline">as_mut_ptr</span> 方法访问 <b>slice 的裸指针</b> 
</p>

<pre class="example">
    在这个例子中，因为有一个 i32 值的可变 slice，as_mut_ptr 返回一个 *mut i32 类型的裸指针，储存在 ptr 变量中
</pre>
<p>
保持索引 mid 位于 slice 中的断言。接着是不安全代码： <span class="underline">slice::from_raw_parts_mut</span>  函数获取一个裸指针和一个长度来 <b>创建</b> 一个 slice：
</p>
<ul class="org-ul">
<li>使用此函数从 ptr 中创建了一个有 mid 个项的 slice</li>
<li>在 ptr 上调用 offset 方法并使用 mid 作为参数来获取一个从 mid 开始的裸指针，使用这个裸指针并以 mid 之后项的数量为长度创建一个 slice</li>
</ul>

<pre class="example">
slice::from_raw_parts_mut 函数是不安全的因为它获取一个裸指针，并必须确信这个指针是有效的

裸指针上的 offset 方法也是不安全的，因为其必须确信此地址偏移量也是有效的指针

因此必须将 slice::from_raw_parts_mut 和 offset 放入 unsafe 块中以便能调用它们

通过观察代码，和增加 mid 必然小于等于 len 的断言，可以说 unsafe 块中所有的裸指针将是有效的 slice 中数据的指针。这是一个可以接受的 unsafe 的恰当用法
</pre>

<p>
注意：无需将 split_at_mut 函数的结果标记为 unsafe，并可以在安全 Rust 中调用此函数。因为创建了一个不安全代码的安全抽象，其代码以一种安全的方式使用了 unsafe 代码，其只从这个函数访问的数据中创建了有效的指针
</p>

<p>
与此相对，下面示例中的 slice::from_raw_parts_mut 在使用 slice 时很有可能会崩溃。这段代码获取任意内存地址并创建了一个长为一万的 slice：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">use</span> <span style="color: #7fffd4;">std</span>::slice;

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">address</span> = 0x01234usize;
<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">r</span> = address <span style="color: #00ffff;">as</span> *<span style="color: #00ffff;">mut</span> <span style="color: #98fb98;">i32</span>;

<span style="color: #00ffff;">let</span> <span style="color: #eedd82;">slice</span>: &amp;[<span style="color: #98fb98;">i32</span>] = <span style="color: #ffc0cb; font-weight: bold;">unsafe</span> {
    <span style="color: #7fffd4;">slice</span>::from_raw_parts_mut(r, 10000)
};
</pre>
</div>

<p>
并不拥有这个任意地址的内存，也不能保证这段代码创建的 slice 包含有效的 i32 值。试图使用臆测为有效的 slice 会导致未定义的行为
</p>
</div>
</div>
<div id="outline-container-org2c1a5b4" class="outline-4">
<h4 id="org2c1a5b4">使用 extern 函数调用外部代码</h4>
<div class="outline-text-4" id="text-org2c1a5b4">
<p>
有时 Rust 代码可能需要与其他语言编写的代码交互。为此 Rust 有一个关键字 <span class="underline">extern</span> ，有助于创建和使用外部函数接口。外部函数接口是一个编程语言用以定义函数的方式，其允许不同（外部）编程语言调用这些函数。下面示例展示了如何集成 C 标准库中的 abs 函数：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00ffff;">extern</span> <span style="color: #ffa07a;">"C"</span> {
    <span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">abs</span>(<span style="color: #eedd82;">input</span>: <span style="color: #98fb98;">i32</span>) -&gt; <span style="color: #98fb98;">i32</span>;
}

<span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">main</span>() {
    <span style="color: #ffc0cb; font-weight: bold;">unsafe</span> {
        <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"Absolute value of -3 according to C: </span><span style="color: #ffa07a; font-style: italic;">{}</span><span style="color: #ffa07a;">"</span>, abs(-3));
    }
}
</pre>
</div>

<pre class="example">
extern 块中声明的函数在 Rust 代码中总是不安全的

因为其他语言不会强制执行 Rust 的规则且 Rust 无法检查它们，所以确保其安全是程序员的责任
</pre>

<p>
在 extern "C" 块中，列出了希望能够调用的另一个语言中的外部函数的签名和名称
</p>

<pre class="example">
"C" 部分定义了外部函数所使用的 应用程序接口(application binary interface，ABI) 

ABI 定义了如何在汇编语言层面调用此函数，"C" ABI 是最常见的，并遵循 C 编程语言的 ABI
</pre>
</div>

<div id="outline-container-orge6cf4c6" class="outline-5">
<h5 id="orge6cf4c6">从其它语言调用 Rust 函数</h5>
<div class="outline-text-5" id="text-orge6cf4c6">
<p>
也可以使用 extern 来创建一个允许其他语言调用 Rust 函数的接口。不同于 extern 块，就在 fn 关键字之前增加 extern 关键字并指定所用到的 ABI。还需增加 <span class="underline">#[no_mangle]</span> 注解来告诉 Rust 编译器不要 mangle 此函数的名称
</p>

<pre class="example">
Mangling 发生于当编译器将指定的函数名修改为不同的名称时，这会增加用于其他编译过程的额外信息，不过会使其名称更难以阅读

每一个编程语言的编译器都会以稍微不同的方式 mangle 函数名，所以为了使 Rust 函数能在其他语言中指定，必须禁用 Rust 编译器的 name mangling
</pre>

<p>
在如下的例子中，一旦其编译为动态库并从 C 语言中链接，call_from_c 函数就能够在 C 代码中访问：
</p>


<div class="org-src-container">
<pre class="src src-rust"><span style="color: #7fffd4;">#[no_mangle]</span>
<span style="color: #00ffff;">pub</span> <span style="color: #00ffff;">extern</span> <span style="color: #ffa07a;">"C"</span> <span style="color: #00ffff;">fn</span> <span style="color: #87cefa;">call_from_c</span>() {
    <span style="color: #b0c4de;">println!</span>(<span style="color: #ffa07a;">"Just called a Rust function from C!"</span>);
}
</pre>
</div>
<p>
注意：extern 的使用无需 unsafe
</p>
</div>
</div>
</div>
</div>
